<?php
/**
 * ----------------------
 * ErrorCode.php
 * 
 * User: jian0307@icloud.com
 * Date: 2015/6/9
 * Time: 16:11
 * ----------------------
 */

namespace library\SmsLib\SmsCloopen;


/**
 * 云通讯，模板短信错误码
 * Class ErrorCode
 * @package library\SmsLib\SmsCloopen
 */
class ErrorCode {
    /**
     * 错误码定义
     * @var array
     */
    static $_ERROR_NO_ = array(
        '000000'        => '发送成功',
        '112300'        => '接收短信的手机号码为空',
        '112301'        => '短信正文为空',
        '112302'        => '群发短信已暂停',
        '112303'        => '应用未开通短信功能',
        '112304'        => '短信内容的编码转换有误',
        '112305'        => '应用未上线，短信接收号码外呼受限',
        '112306'        => '接收模板短信的手机号码为空',
        '112307'        => '模板短信模板ID为空',
        '112308'        => '模板短信模板data参数为空',
        '112309'        => '模板短信内容的编码转换有误',
        '112310'        => '应用未上线，模板短信接收号码外呼受限',
        '112311'        => '短信模板不存在',
        '172001'        => '网络错误',
        '172004'        =>	'IP为空',
        '172005'        =>	'端口错误（小于等于0）',
        '172013'	    =>  '版本号为空',
        '172006'	    =>  '主帐号为空',
        '172007'	    =>  '主帐号令牌为空',
        '172012'	    =>  '应用ID为空',
    );
}